Vulintus/Vulintus_Board_Definitions/hardware/avr/0.1.0/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/


menu.pcb_ver=Circuit Board Version


########################################################################################################################
# MotoTrak Autopositioner (VP-MA)
# --------------------------

mototrak_autopositioner.name=MotoTrak Autopositioner (MT-AP)

# VID/PID for Bootloader, Arduino & CircuitPython
# For now, the Autopositioner uses the same VID/PID as the Arduino Uno.
mototrak_autopositioner.vid.0=0x2341
mototrak_autopositioner.pid.0=0x0043
mototrak_autopositioner.upload_port.0.vid=0x2341
mototrak_autopositioner.upload_port.0.pid=0x0043

# Upload
mototrak_autopositioner.upload.maximum_size=32256
mototrak_autopositioner.upload.maximum_data_size=2048
mototrak_autopositioner.upload.protocol=arduino
mototrak_autopositioner.upload.speed=115200
mototrak_autopositioner.upload.tool=avrdude
mototrak_autopositioner.upload.tool.default=avrdude

# Build
mototrak_autopositioner.build.board=AVR_MOTOTRAK_AUTOPOSITIONER
mototrak_autopositioner.build.core=arduino:arduino
mototrak_autopositioner.build.f_cpu=16000000L
mototrak_autopositioner.build.mcu=atmega328p
# MOVED TO MENU: mototrak_autopositioner.build.variant=mototrak_autopositioner_v1_3
mototrak_autopositioner.build.extra_flags=-DVULINTUS_MOTOTRAK_AUTOPOSITIONER

# Bootloader
mototrak_autopositioner.bootloader.file=optiboot/optiboot_atmega328.hex
mototrak_autopositioner.bootloader.tool=avrdude
mototrak_autopositioner.bootloader.tool.default=avrdude
mototrak_autopositioner.bootloader.low_fuses=0xFF
mototrak_autopositioner.bootloader.high_fuses=0xDE
mototrak_autopositioner.bootloader.extended_fuses=0xFD
mototrak_autopositioner.bootloader.lock_bits=0x0F
mototrak_autopositioner.bootloader.unlock_bits=0x3F

# Menu
mototrak_autopositioner.menu.pcb_ver.v1_3=Version 1.3
mototrak_autopositioner.menu.pcb_ver.v1_3.build.variant=mototrak_autopositioner_v1_3


########################################################################################################################
# MotoTrak Pellet Pedestal Module (MT-PP)
# --------------------------

mototrak_pellet_pedestal.name=MotoTrak Pellet Pedestal Module (MT-PP)

# VID/PID for Bootloader, Arduino & CircuitPython
mototrak_pellet_pedestal.vid.0=0x0403 
mototrak_pellet_pedestal.pid.0=0x6A21
mototrak_pellet_pedestal.upload_port.0.vid=0x0403 
mototrak_pellet_pedestal.upload_port.0.pid=0x6A21

# Upload
mototrak_pellet_pedestal.upload.maximum_size=32256
mototrak_pellet_pedestal.upload.maximum_data_size=2048
mototrak_pellet_pedestal.upload.protocol=arduino
mototrak_pellet_pedestal.upload.speed=115200
mototrak_pellet_pedestal.upload.tool=avrdude
mototrak_pellet_pedestal.upload.tool.default=avrdude

# Build
mototrak_pellet_pedestal.build.board=AVR_MOTOTRAK_PELLET_PEDESTAL
mototrak_pellet_pedestal.build.core=arduino:arduino
mototrak_pellet_pedestal.build.f_cpu=16000000L
mototrak_pellet_pedestal.build.mcu=atmega328p
# MOVED TO MENU: mototrak_pellet_pedestal.build.variant=mototrak_pellet_pedestal_v0_1
mototrak_pellet_pedestal.build.extra_flags=-DVULINTUS_MOTOTRAK_PELLET_PEDESTAL

# Bootloader
mototrak_pellet_pedestal.bootloader.file=optiboot/optiboot_atmega328.hex
mototrak_pellet_pedestal.bootloader.tool=avrdude
mototrak_pellet_pedestal.bootloader.tool.default=avrdude
mototrak_pellet_pedestal.bootloader.low_fuses=0xFF
mototrak_pellet_pedestal.bootloader.high_fuses=0xDE
mototrak_pellet_pedestal.bootloader.extended_fuses=0xFD
mototrak_pellet_pedestal.bootloader.lock_bits=0x0F
mototrak_pellet_pedestal.bootloader.unlock_bits=0x3F

# Menu
mototrak_pellet_pedestal.menu.pcb_ver.v0_1=Version 0.1
mototrak_pellet_pedestal.menu.pcb_ver.v0_1.build.variant=mototrak_pellet_pedestal_v0_1
mototrak_pellet_pedestal.menu.pcb_ver.v0_2=Version 0.2
mototrak_pellet_pedestal.menu.pcb_ver.v0_2.build.variant=mototrak_pellet_pedestal_v0_2
mototrak_pellet_pedestal.menu.pcb_ver.v0_3=Version 0.3
mototrak_pellet_pedestal.menu.pcb_ver.v0_3.build.variant=mototrak_pellet_pedestal_v0_3


########################################################################################################################
# OmniTrak Pellet Receiver (OT-PR)
# --------------------------

omnitrak_pellet_receiver.name=OmniTrak Pellet Receiver Module (OT-PR)

# VID/PID for Bootloader, Arduino & CircuitPython
omnitrak_pellet_receiver.vid.0=0x0403 
omnitrak_pellet_receiver.pid.0=0x6A20
omnitrak_pellet_receiver.upload_port.0.vid=0x0403 
omnitrak_pellet_receiver.upload_port.0.pid=0x6A20

# Upload
omnitrak_pellet_receiver.upload.maximum_size=32256
omnitrak_pellet_receiver.upload.maximum_data_size=2048
omnitrak_pellet_receiver.upload.protocol=arduino
omnitrak_pellet_receiver.upload.speed=115200
omnitrak_pellet_receiver.upload.tool=avrdude
omnitrak_pellet_receiver.upload.tool.default=avrdude

# Build
omnitrak_pellet_receiver.build.board=AVR_OMNITRAK_PELLET_RECEIVER
omnitrak_pellet_receiver.build.core=arduino:arduino
omnitrak_pellet_receiver.build.f_cpu=16000000L
omnitrak_pellet_receiver.build.mcu=atmega328p
# MOVED TO MENU: omnitrak_pellet_receiver.build.variant=omnitrak_pellet_receiver_v3_1
omnitrak_pellet_receiver.build.extra_flags=-DVULINTUS_OMNITRAK_PELLET_RECEIVER

# Bootloader
omnitrak_pellet_receiver.bootloader.file=optiboot/optiboot_atmega328.hex
omnitrak_pellet_receiver.bootloader.tool=avrdude
omnitrak_pellet_receiver.bootloader.tool.default=avrdude
omnitrak_pellet_receiver.bootloader.low_fuses=0xFF
omnitrak_pellet_receiver.bootloader.high_fuses=0xDE
omnitrak_pellet_receiver.bootloader.extended_fuses=0xFD
omnitrak_pellet_receiver.bootloader.lock_bits=0x0F
omnitrak_pellet_receiver.bootloader.unlock_bits=0x3F

# Menu
omnitrak_pellet_receiver.menu.pcb_ver.v3_0=Version 3.0
omnitrak_pellet_receiver.menu.pcb_ver.v3_0.build.variant=omnitrak_nosepoke_v3_0
omnitrak_pellet_receiver.menu.pcb_ver.v3_1=Version 3.1
omnitrak_pellet_receiver.menu.pcb_ver.v3_1.build.variant=omnitrak_nosepoke_v3_1


########################################################################################################################
# OmniTrak Pocket Door Module (OT-PD)
# --------------------------

omnitrak_pocket_door.name=OmniTrak Pocket Door Module (OT-PD)

# VID/PID for Bootloader, Arduino & CircuitPython
omnitrak_pocket_door.vid.0=0x0403 
omnitrak_pocket_door.pid.0=0x6A26
omnitrak_pocket_door.upload_port.0.vid=0x0403 
omnitrak_pocket_door.upload_port.0.pid=0x6A26

# Upload
omnitrak_pocket_door.upload.maximum_size=32256
omnitrak_pocket_door.upload.maximum_data_size=2048
omnitrak_pocket_door.upload.protocol=arduino
omnitrak_pocket_door.upload.speed=115200
omnitrak_pocket_door.upload.tool=avrdude
omnitrak_pocket_door.upload.tool.default=avrdude

# Build
omnitrak_pocket_door.build.board=AVR_OMNITRAK_POCKET_DOOR
omnitrak_pocket_door.build.core=arduino:arduino
omnitrak_pocket_door.build.f_cpu=16000000L
omnitrak_pocket_door.build.mcu=atmega328p
# MOVED TO MENU: omnitrak_pocket_door.build.variant=omnitrak_pocket_door_v0_1
omnitrak_pocket_door.build.extra_flags=-DVULINTUS_OMNITRAK_POCKET_DOOR

# Bootloader
omnitrak_pocket_door.bootloader.file=optiboot/optiboot_atmega328.hex
omnitrak_pocket_door.bootloader.tool=avrdude
omnitrak_pocket_door.bootloader.tool.default=avrdude
omnitrak_pocket_door.bootloader.low_fuses=0xFF
omnitrak_pocket_door.bootloader.high_fuses=0xDE
omnitrak_pocket_door.bootloader.extended_fuses=0xFD
omnitrak_pocket_door.bootloader.lock_bits=0x0F
omnitrak_pocket_door.bootloader.unlock_bits=0x3F

# Menu
omnitrak_pocket_door.menu.pcb_ver.v0_1=Version 0.1
omnitrak_pocket_door.menu.pcb_ver.v0_1.build.variant=omnitrak_pocket_door_v0_1


########################################################################################################################
# OmniTrak Nosepoke Module (OT-NP)
# --------------------------

