Vulintus/Vulintus_Board_Definitions/hardware/avr/0.1.0/boards.txt
omnitrak_nosepoke.name=OmniTrak Nosepoke Module (OT-NP)

# VID/PID for Bootloader, Arduino & CircuitPython
omnitrak_nosepoke.vid.0=0x0403 
omnitrak_nosepoke.pid.0=0x6A20
omnitrak_nosepoke.upload_port.0.vid=0x0403 
omnitrak_nosepoke.upload_port.0.pid=0x6A20

# Upload
omnitrak_nosepoke.upload.maximum_size=32256
omnitrak_nosepoke.upload.maximum_data_size=2048
omnitrak_nosepoke.upload.protocol=arduino
omnitrak_nosepoke.upload.speed=115200
omnitrak_nosepoke.upload.tool=avrdude
omnitrak_nosepoke.upload.tool.default=avrdude

# Build
omnitrak_nosepoke.build.board=AVR_OMNITRAK_NOSEPOKE
omnitrak_nosepoke.build.core=arduino:arduino
omnitrak_nosepoke.build.f_cpu=16000000L
omnitrak_nosepoke.build.mcu=atmega328p
# MOVED TO MENU: omnitrak_nosepoke.build.variant=omnitrak_nosepoke_v3_1
omnitrak_nosepoke.build.extra_flags=-DVULINTUS_OMNITRAK_NOSEPOKE

# Bootloader
omnitrak_nosepoke.bootloader.file=optiboot/optiboot_atmega328.hex
omnitrak_nosepoke.bootloader.tool=avrdude
omnitrak_nosepoke.bootloader.tool.default=avrdude
omnitrak_nosepoke.bootloader.low_fuses=0xFF
omnitrak_nosepoke.bootloader.high_fuses=0xDE
omnitrak_nosepoke.bootloader.extended_fuses=0xFD
omnitrak_nosepoke.bootloader.lock_bits=0x0F
omnitrak_nosepoke.bootloader.unlock_bits=0x3F

# Menu
omnitrak_nosepoke.menu.pcb_ver.v3_0=Version 3.0
omnitrak_nosepoke.menu.pcb_ver.v3_0.build.variant=omnitrak_nosepoke_v3_0
omnitrak_nosepoke.menu.pcb_ver.v3_1=Version 3.1
omnitrak_nosepoke.menu.pcb_ver.v3_1.build.variant=omnitrak_nosepoke_v3_1


########################################################################################################################
# OmniTrak Three-Nosepoke Module (OT-3P)
# --------------------------

omnitrak_three_nosepoke.name=OmniTrak Three-Nosepoke Module (OT-3P)

# VID/PID for Bootloader, Arduino & CircuitPython
omnitrak_three_nosepoke.vid.0=0x0403 
omnitrak_three_nosepoke.pid.0=0x6A24
omnitrak_three_nosepoke.upload_port.0.vid=0x0403 
omnitrak_three_nosepoke.upload_port.0.pid=0x6A24

# Upload
omnitrak_three_nosepoke.upload.maximum_size=32256
omnitrak_three_nosepoke.upload.maximum_data_size=2048
omnitrak_three_nosepoke.upload.protocol=arduino
omnitrak_three_nosepoke.upload.speed=115200
omnitrak_three_nosepoke.upload.tool=avrdude
omnitrak_three_nosepoke.upload.tool.default=avrdude

# Build
omnitrak_three_nosepoke.build.board=AVR_OMNITRAK_THREE_NOSEPOKE
omnitrak_three_nosepoke.build.core=arduino:arduino
omnitrak_three_nosepoke.build.f_cpu=16000000L
omnitrak_three_nosepoke.build.mcu=atmega328p
# MOVED TO MENU: omnitrak_three_nosepoke.build.variant=omnitrak_three_nosepoke_v2_3
omnitrak_three_nosepoke.build.extra_flags=-DVULINTUS_OMNITRAK_THREE_NOSEPOKE

# Bootloader
omnitrak_three_nosepoke.bootloader.file=optiboot/optiboot_atmega328.hex
omnitrak_three_nosepoke.bootloader.tool=avrdude
omnitrak_three_nosepoke.bootloader.tool.default=avrdude
omnitrak_three_nosepoke.bootloader.low_fuses=0xFF
omnitrak_three_nosepoke.bootloader.high_fuses=0xDE
omnitrak_three_nosepoke.bootloader.extended_fuses=0xFD
omnitrak_three_nosepoke.bootloader.lock_bits=0x0F
omnitrak_three_nosepoke.bootloader.unlock_bits=0x3F

# Menu
omnitrak_three_nosepoke.menu.pcb_ver.v2_3=Version 2.3
omnitrak_three_nosepoke.menu.pcb_ver.v2_3.build.variant=omnitrak_three_nosepoke_v2_3


########################################################################################################################
# SensiTrak Arm Proprioception Module (ST-AP)
# --------------------------

sensitrak_arm_proprioception.name=SensiTrak Arm Proprioception Module (ST-AP)

# VID/PID for Bootloader, Arduino & CircuitPython
sensitrak_arm_proprioception.vid.0=0x0403 
sensitrak_arm_proprioception.pid.0=0x6A23
sensitrak_arm_proprioception.upload_port.0.vid=0x0403 
sensitrak_arm_proprioception.upload_port.0.pid=0x6A23

# Upload
sensitrak_arm_proprioception.upload.maximum_size=32256
sensitrak_arm_proprioception.upload.maximum_data_size=2048
sensitrak_arm_proprioception.upload.protocol=arduino
sensitrak_arm_proprioception.upload.speed=115200
sensitrak_arm_proprioception.upload.tool=avrdude
sensitrak_arm_proprioception.upload.tool.default=avrdude

# Build
sensitrak_arm_proprioception.build.board=AVR_SENSITRAK_ARM_PROPRIOCEPTION
sensitrak_arm_proprioception.build.core=arduino:arduino
sensitrak_arm_proprioception.build.f_cpu=16000000L
sensitrak_arm_proprioception.build.mcu=atmega328p
# MOVED TO MENU: sensitrak_arm_proprioception.build.variant=sensitrak_arm_proprioception_v0_3
sensitrak_arm_proprioception.build.extra_flags=-DVULINTUS_SENSITRAK_ARM_PROPRIOCEPTION

# Bootloader
sensitrak_arm_proprioception.bootloader.file=optiboot/optiboot_atmega328.hex
sensitrak_arm_proprioception.bootloader.tool=avrdude
sensitrak_arm_proprioception.bootloader.tool.default=avrdude
sensitrak_arm_proprioception.bootloader.low_fuses=0xFF
sensitrak_arm_proprioception.bootloader.high_fuses=0xDE
sensitrak_arm_proprioception.bootloader.extended_fuses=0xFD
sensitrak_arm_proprioception.bootloader.lock_bits=0x0F
sensitrak_arm_proprioception.bootloader.unlock_bits=0x3F

# Menu
sensitrak_arm_proprioception.menu.pcb_ver.v0_3=Version 0.3
sensitrak_arm_proprioception.menu.pcb_ver.v0_3.build.variant=sensitrak_arm_proprioception_v0_3


########################################################################################################################
# SensiTrak Tactile Carousel Module (ST-TC)
# --------------------------

sensitrak_tactile_carousel.name=SensiTrak Tactile Carousel Module (ST-TC)

# VID/PID for Bootloader, Arduino & CircuitPython
sensitrak_tactile_carousel.vid.0=0x0403 
sensitrak_tactile_carousel.pid.0=0x6A22
sensitrak_tactile_carousel.upload_port.0.vid=0x0403 
sensitrak_tactile_carousel.upload_port.0.pid=0x6A22

# Upload
sensitrak_tactile_carousel.upload.maximum_size=32256
sensitrak_tactile_carousel.upload.maximum_data_size=2048
sensitrak_tactile_carousel.upload.protocol=arduino
sensitrak_tactile_carousel.upload.speed=115200
sensitrak_tactile_carousel.upload.tool=avrdude
sensitrak_tactile_carousel.upload.tool.default=avrdude

# Build
sensitrak_tactile_carousel.build.board=AVR_SENSITRAK_TACTILE_CAROUSEL
sensitrak_tactile_carousel.build.core=arduino:arduino
sensitrak_tactile_carousel.build.f_cpu=16000000L
sensitrak_tactile_carousel.build.mcu=atmega328p
# MOVED TO MENU: sensitrak_tactile_carousel.build.variant=sensitrak_tactile_carousel_v0_1
sensitrak_tactile_carousel.build.extra_flags=-DVULINTUS_SENSITRAK_ARM_PROPRIOCEPTION

# Bootloader
sensitrak_tactile_carousel.bootloader.file=optiboot/optiboot_atmega328.hex
sensitrak_tactile_carousel.bootloader.tool=avrdude
sensitrak_tactile_carousel.bootloader.tool.default=avrdude
sensitrak_tactile_carousel.bootloader.low_fuses=0xFF
sensitrak_tactile_carousel.bootloader.high_fuses=0xDE
sensitrak_tactile_carousel.bootloader.extended_fuses=0xFD
sensitrak_tactile_carousel.bootloader.lock_bits=0x0F
sensitrak_tactile_carousel.bootloader.unlock_bits=0x3F

# Menu
sensitrak_tactile_carousel.menu.pcb_ver.v0_1=Version 0.1
sensitrak_tactile_carousel.menu.pcb_ver.v0_1.build.variant=sensitrak_tactile_carousel_v0_1

########################################################################################################################
# SensiTrak Vibrotactile Module (ST-VT)
# --------------------------

sensitrak_vibrotactile.name=SensiTrak Vibrotactile Module (ST-VT)

# VID/PID for Bootloader, Arduino & CircuitPython
sensitrak_vibrotactile.vid.0=0x0403 
sensitrak_vibrotactile.pid.0=0x6A25
sensitrak_vibrotactile.upload_port.0.vid=0x0403 
sensitrak_vibrotactile.upload_port.0.pid=0x6A25

# Upload
sensitrak_vibrotactile.upload.maximum_size=32256
sensitrak_vibrotactile.upload.maximum_data_size=2048
sensitrak_vibrotactile.upload.protocol=arduino
sensitrak_vibrotactile.upload.speed=115200
sensitrak_vibrotactile.upload.tool=avrdude
sensitrak_vibrotactile.upload.tool.default=avrdude

# Build
sensitrak_vibrotactile.build.board=AVR_SENSITRAK_VIBROTACTILE
sensitrak_vibrotactile.build.core=arduino:arduino
sensitrak_vibrotactile.build.f_cpu=16000000L
sensitrak_vibrotactile.build.mcu=atmega328p
# MOVED TO MENU: sensitrak_vibrotactile.build.variant=sensitrak_vibrotactile_v2_1
sensitrak_vibrotactile.build.extra_flags=-DVULINTUS_SENSITRAK_VIBROTACTILE

# Bootloader
sensitrak_vibrotactile.bootloader.file=optiboot/optiboot_atmega328.hex
sensitrak_vibrotactile.bootloader.tool=avrdude
sensitrak_vibrotactile.bootloader.tool.default=avrdude
sensitrak_vibrotactile.bootloader.low_fuses=0xFF
sensitrak_vibrotactile.bootloader.high_fuses=0xDE
sensitrak_vibrotactile.bootloader.extended_fuses=0xFD
sensitrak_vibrotactile.bootloader.lock_bits=0x0F
sensitrak_vibrotactile.bootloader.unlock_bits=0x3F

# Menu
sensitrak_vibrotactile.menu.pcb_ver.v2_1=Version 2.1
sensitrak_vibrotactile.menu.pcb_ver.v2_1.build.variant=sensitrak_vibrotactile_v2_1


########################################################################################################################
# VPB Pellet Dispenser (PB-PD)
# -------------------------

vpb_pellet_dispenser.name=VPB Pellet Dispenser (PB-LD)

# VID/PID for Bootloader, Arduino & CircuitPython
vpb_pellet_dispenser.vid.0=0x2341
vpb_pellet_dispenser.pid.0=0x0043
vpb_pellet_dispenser.upload_port.0.vid=0x2341 
vpb_pellet_dispenser.upload_port.0.pid=0x0043

# Upload
vpb_pellet_dispenser.upload.maximum_size=32256
vpb_pellet_dispenser.upload.maximum_data_size=2048
vpb_pellet_dispenser.upload.protocol=arduino
vpb_pellet_dispenser.upload.speed=115200
vpb_pellet_dispenser.upload.tool=avrdude
vpb_pellet_dispenser.upload.tool.default=avrdude

# Build
vpb_pellet_dispenser.build.board=AVR_VPB_PELLET_DISPENSER
vpb_pellet_dispenser.build.core=arduino:arduino
vpb_pellet_dispenser.build.f_cpu=16000000L
vpb_pellet_dispenser.build.mcu=atmega328p
vpb_pellet_dispenser.build.extra_flags=-DVULINTUS_VPB_PELLET_DISPENSER

# Bootloader
vpb_pellet_dispenser.bootloader.file=optiboot/optiboot_atmega328.hex
vpb_pellet_dispenser.bootloader.tool=avrdude
vpb_pellet_dispenser.bootloader.tool.default=avrdude
vpb_pellet_dispenser.bootloader.low_fuses=0xFF
vpb_pellet_dispenser.bootloader.high_fuses=0xDE
vpb_pellet_dispenser.bootloader.extended_fuses=0xFD
vpb_pellet_dispenser.bootloader.lock_bits=0x0F
vpb_pellet_dispenser.bootloader.unlock_bits=0x3F

# Menu
vpb_pellet_dispenser.menu.pcb_ver.v0_1=Version 5.2
vpb_pellet_dispenser.menu.pcb_ver.v0_1.build.variant=vpb_pellet_dispenser_v5_2

########################################################################################################################